[
  {
    "query": "I'm Marcus, 42. Diagnosed with hypertension. What's the usual first medication?",
    "report": "Thiazide diuretics like Hydrochlorothiazide or ACE inhibitors like Lisinopril are common first-line treatments for high blood pressure."
  },
  {
    "query": "My name is Lena, 35. I have bacterial pneumonia. What antibiotic is standard?",
    "report": "Community-acquired pneumonia is typically treated with Amoxicillin, Doxycycline, or respiratory Fluoroquinolones like Levofloxacin."
  },
  {
    "query": "I'm Victor, 58. Diagnosed with type 2 diabetes. What's the first medication tried?",
    "report": "Metformin is the first-line medication for type 2 diabetes, helping improve insulin sensitivity."
  },
  {
    "query": "My name is Clara, 29. I have migraine headaches. What abortive medication?",
    "report": "Triptans like Sumatriptan or Rizatriptan are first-line for acute migraine attacks."
  },
  {
    "query": "I'm Oscar, 67. Diagnosed with COPD. What maintenance inhaler?",
    "report": "Long-acting bronchodilators like Tiotropium or combination inhalers with corticosteroids are standard for COPD maintenance."
  },
  {
    "query": "My name is Nina, 44. I have rheumatoid arthritis. What DMARD?",
    "report": "Methotrexate is typically the first disease-modifying antirheumatic drug for rheumatoid arthritis."
  },
  {
    "query": "I'm Julian, 51. Diagnosed with acid reflux. What PPI?",
    "report": "Omeprazole, Esomeprazole, or Pantoprazole are common proton pump inhibitors for GERD."
  },
  {
    "query": "My name is Iris, 38. I have urinary tract infection. What antibiotic?",
    "report": "Nitrofurantoin or Trimethoprim-sulfamethoxazole are first-line for uncomplicated UTIs."
  },
  {
    "query": "I'm Simon, 63. Diagnosed with atrial fibrillation. What anticoagulant?",
    "report": "Direct oral anticoagulants like Apixaban or Dabigatran are commonly used for stroke prevention in AFib."
  },
  {
    "query": "My name is Elise, 47. I have osteoporosis. What bisphosphonate?",
    "report": "Alendronate is a common first-line bisphosphonate for osteoporosis treatment."
  },
  {
    "query": "I'm Felix, 32. I have strep throat. What antibiotic?",
    "report": "Penicillin or Amoxicillin are standard treatments for streptococcal pharyngitis."
  },
  {
    "query": "My name is Ada, 56. I have shingles. What antiviral?",
    "report": "Acyclovir, Valacyclovir, or Famciclovir are prescribed for herpes zoster to reduce duration and severity."
  },
  {
    "query": "I'm Walter, 61. Diagnosed with gout. What for acute attack?",
    "report": "NSAIDs like Indomethacin, Colchicine, or corticosteroids are used for acute gout pain."
  },
  {
    "query": "My name is Cora, 41. I have depression. What SSRI?",
    "report": "Sertraline, Escitalopram, or Fluoxetine are common first-line SSRIs for depression."
  },
  {
    "query": "I'm Hugo, 53. Diagnosed with BPH. What alpha-blocker?",
    "report": "Tamsulosin or Alfuzosin are alpha-blockers commonly used for benign prostatic hyperplasia symptoms."
  },
  {
    "query": "My name is Vera, 36. I have hypothyroidism. What replacement?",
    "report": "Levothyroxine is the standard thyroid hormone replacement therapy."
  },
  {
    "query": "I'm Leon, 59. Diagnosed with psoriasis. What topical treatment?",
    "report": "Topical corticosteroids like Triamcinolone or Vitamin D analogs like Calcipotriene are first-line."
  },
  {
    "query": "My name is Maya, 45. I have anxiety disorder. What medication?",
    "report": "SSRIs like Sertraline or SNRIs like Venlafaxine are first-line for anxiety disorders."
  },
  {
    "query": "I'm Otto, 68. Diagnosed with Parkinson's. What dopamine therapy?",
    "report": "Levodopa-carbidopa is the primary treatment for Parkinson's disease motor symptoms."
  },
  {
    "query": "My name is Ruth, 39. I have birth control needs. What options?",
    "report": "Combination oral contraceptives, progestin-only pills, or long-acting reversible contraceptives are common choices."
  },
  {
    "query": "I have a headache. Can I take Ibuprofen?",
    "report": "Yes, Ibuprofen is an effective OTC option for tension headaches in adults when used as directed."
  },
  {
    "query": "My name is Anton, 48. I have heartburn. Can I take Tums?",
    "report": "Yes, Calcium carbonate antacids like Tums are appropriate for occasional mild heartburn."
  },
  {
    "query": "I'm Greta, 33. I have seasonal allergies. Is Loratadine safe daily?",
    "report": "Yes, Loratadine is a non-sedating antihistamine safe for daily use during allergy season."
  },
  {
    "query": "My name is Lars, 57. I have toenail fungus. Can I use topical Terbinafine?",
    "report": "Topical antifungals have limited nail penetration. Oral Terbinafine is more effective for fungal nails."
  },
  {
    "query": "I'm Heidi, 26. I have menstrual cramps. Is Naproxen appropriate?",
    "report": "Yes, Naproxen is excellent for menstrual cramps as it reduces prostaglandin production."
  },
  {
    "query": "My name is Emil, 52. I have back pain. Can I take Aspirin?",
    "report": "Yes, Aspirin can help mild back pain, though NSAIDs like Ibuprofen may be more effective."
  },
  {
    "query": "I'm Frieda, 64. I have arthritis pain. Is Acetaminophen safe?",
    "report": "Yes, Acetaminophen is first-line for osteoarthritis pain when used at recommended doses."
  },
  {
    "query": "My name is Klaus, 43. I have poison oak rash. Can I use Hydrocortisone?",
    "report": "Yes, OTC Hydrocortisone cream can help relieve itching from poison oak dermatitis."
  },
  {
    "query": "I'm Anna, 31. I have canker sore. Is Orajel safe to use?",
    "report": "Yes, Benzocaine products like Orajel provide temporary pain relief for canker sores."
  },
  {
    "query": "My name is Erik, 49. I have constipation. Is Docusate sodium okay?",
    "report": "Yes, Docusate is a gentle stool softener appropriate for occasional constipation."
  },
  {
    "query": "I'm Ingrid, 28. I have motion sickness. Can I take Dramamine?",
    "report": "Yes, Dimenhydrinate is effective for motion sickness prevention when taken before travel."
  },
  {
    "query": "My name is Stefan, 55. I have hemorrhoids. Is Preparation H appropriate?",
    "report": "Yes, Preparation H with Hydrocortisone is suitable for short-term hemorrhoid symptom relief."
  },
  {
    "query": "I'm Marta, 37. I have cold sores. Is Abreva effective?",
    "report": "Yes, Docosanol cream can reduce healing time when applied at first sign of outbreak."
  },
  {
    "query": "My name is Karl, 46. I have athlete's foot. Can I use Lotrimin?",
    "report": "Yes, Clotrimazole is an effective OTC antifungal for athlete's foot."
  },
  {
    "query": "I'm Lena, 34. I have dandruff. Is Head & Shoulders okay?",
    "report": "Yes, Pyrithione zinc shampoo is effective for common dandruff with regular use."
  },
  {
    "query": "My name is Hans, 58. I have acid reflux. Is Pepcid AC safe?",
    "report": "Yes, Famotidine is safe for occasional heartburn relief."
  },
  {
    "query": "I'm Gisela, 42. I have dry eyes. Are artificial tears safe?",
    "report": "Yes, preservative-free artificial tears are safe for regular dry eye use."
  },
  {
    "query": "My name is Werner, 61. I have bronchitis cough. Is Robitussin DM okay?",
    "report": "Yes, Dextromethorphan can help suppress cough from bronchitis."
  },
  {
    "query": "I'm Sabine, 29. I have sunburn. Can I use Aloe Vera gel?",
    "report": "Yes, Aloe Vera can soothe sunburn, but avoid products with added anesthetics."
  },
  {
    "query": "My name is Dieter, 53. I have nasal congestion. Is Afrin safe?",
    "report": "Oxymetazoline should only be used for 3 days maximum to avoid rebound congestion."
  },
  {
    "query": "I'm Ute, 39. I have vaginal itching. Is Monistat appropriate?",
    "report": "Yes, if you've had diagnosed yeast infections before, OTC Miconazole is appropriate."
  },
  {
    "query": "My name is Franz, 50. I have muscle strain. Is Bengay safe?",
    "report": "Yes, topical Menthol products are safe for muscle pain relief."
  },
  {
    "query": "I'm Helga, 44. I have cold symptoms. Is DayQuil safe?",
    "report": "Yes, but check for interactions with other medications and avoid with uncontrolled hypertension."
  },
  {
    "query": "My name is Rolf, 47. I have high cholesterol. My Atorvastatin is expensive. Cheaper option?",
    "report": "Generic Atorvastatin is now available. Also ask about other statins like Simvastatin which may be lower cost."
  },
  {
    "query": "I'm Petra, 62. My Eliquis costs too much. Any alternative?",
    "report": "Warfarin is a much cheaper anticoagulant but requires regular blood monitoring and dietary consistency."
  },
  {
    "query": "My name is Gustav, 55. My Advair is expensive. Cheaper version?",
    "report": "Generic Fluticasone/Salmeterol dry powder inhalers are now available at lower cost."
  },
  {
    "query": "I'm Hilda, 41. My Imitrex for migraines is costly. Options?",
    "report": "Generic Sumatriptan is available. Other triptans like Rizatriptan may have different pricing."
  },
  {
    "query": "My name is Johann, 67. My Xarelto is unaffordable. Alternative?",
    "report": "Warfarin is a low-cost alternative but requires frequent INR testing."
  },
  {
    "query": "I'm Karin, 48. My Synthroid is brand-only expensive. Generic?",
    "report": "Generic Levothyroxine is widely available and equally effective for hypothyroidism."
  },
  {
    "query": "My name is Manfred, 59. My Spiriva is costly. Cheaper alternative?",
    "report": "Generic Tiotropium is now available at lower cost than brand Spiriva."
  },
  {
    "query": "I'm Renate, 36. My Latisse is expensive. Any option?",
    "report": "Bimatoprost has no OTC equivalent. Discuss prescription alternatives with your ophthalmologist."
  },
  {
    "query": "My name is Ulrich, 63. My Namenda for dementia is costly. Generic?",
    "report": "Generic Memantine is available and significantly cheaper than brand Namenda."
  },
  {
    "query": "I'm Monika, 45. My NuvaRing is expensive. Cheaper birth control?",
    "report": "Generic oral contraceptives or contraceptive patches are usually more affordable options."
  },
  {
    "query": "I was prescribed Prednisone but worried about weight gain. Is this normal?",
    "report": "Weight gain and fluid retention are common side effects of corticosteroids, usually temporary with short-term use."
  },
  {
    "query": "My name is Gerhard, 58. My doctor wants me on Statin but I fear muscle pain.",
    "report": "Muscle pain is a known side effect. Your doctor can start with a low dose and switch to better-tolerated statins if needed."
  },
  {
    "query": "I'm Brigitte, 70. I need antidepressant but worried about nausea.",
    "report": "SSRIs can cause initial nausea that often subsides. Taking with food and starting low can minimize this."
  },
  {
    "query": "My name as is Kurt, 45. Metformin causes stomach issues. Normal?",
    "report": "GI upset is very common when starting Metformin. Taking with meals or extended-release formulation can help."
  },
  {
    "query": "I'm Ilse, 33. Prescribed Isotretinoin for acne but worried about dryness.",
    "report": "Severe dryness is expected. Intensive moisturizing and lip balm are essential during treatment."
  },
  {
    "query": "My name is Friedrich, 52. My blood pressure med causes cough. Normal?",
    "report": "Dry cough is a common side effect of ACE inhibitors. Your doctor can switch you to an ARB."
  },
  {
    "query": "I'm Anke, 41. My antidepressant makes me jittery. Concern?",
    "report": "Agitation can occur with some antidepressants. Dose adjustment or medication change may help."
  },
  {
    "query": "My name is Bernd, 63. My diabetes drug causes UTIs. Risk?",
    "report": "SGLT2 inhibitors do increase UTI risk. Good hygiene and hydration are important preventive measures."
  },
  {
    "query": "I'm Christa, 29. My birth control causes mood swings. Normal?",
    "report": "Mood changes can occur with hormonal contraceptives. A different formulation may be better tolerated."
  },
  {
    "query": "My name is Detlef, 57. My prostate drug causes dizziness. Concern?",
    "report": "Dizziness is common with alpha-blockers. Rise slowly from sitting or lying position."
  },
  {
    "query": "My 3-year-old has fever. Can I give her a small piece of adult Tylenol?",
    "report": "No, this is dangerous. Use only infant Acetaminophen and measure dose precisely by weight with provided syringe."
  },
  {
    "query": "My 11-year-old son has pink eye. Can I use leftover antibiotic drops?",
    "report": "No, never use old medication. Pink eye requires proper diagnosis and fresh prescription if bacterial."
  },
  {
    "query": "My 7-year-old daughter has cough. Is children's Delsym safe?",
    "report": "Yes, children's Dextromethorphan is generally safe when following age and weight-based dosing."
  },
  {
    "query": "My 16-year-old has severe acne. Can I buy her Differin gel?",
    "report": "Yes, Adapalene (Differin) is now available OTC and is appropriate for adolescent acne."
  },
  {
    "query": "My 9-year-old has strep throat. What antibiotic dosage?",
    "report": "Amoxicillin is commonly prescribed with dosage based precisely on the child's weight."
  },
  {
    "query": "My 5-year-old has ear infection. Can I use my Amoxicillin?",
    "report": "No, never give adult medication to a child. Pediatric doses are weight-based and require proper calculation."
  },
  {
    "query": "My 13-year-old has allergies. Is children's Zyrtec safe daily?",
    "report": "Yes, Cetirizine is safe for children when using pediatric formulation and proper dosing."
  },
  {
    "query": "My 4-year-old has constipation. Is pediatric glycerin suppository safe?",
    "report": "Yes, pediatric glycerin suppositories are safe for occasional constipation relief."
  },
  {
    "query": "My 8-year-old has head lice. Is Nix treatment safe?",
    "report": "Yes, Permethrin is FDA-approved for children 2 months and older when used as directed."
  },
  {
    "query": "My 6-year-old has asthma. Can I give her my Albuterol inhaler?",
    "report": "No, pediatric asthma requires proper diagnosis and age-appropriate delivery devices."
  },
  {
    "query": "I have anxiety but don't want prescriptions. Is Valerian Root effective?",
    "report": "Valerian is used for sleep, not acute anxiety. L-Theanine or therapy are better natural options."
  },
  {
    "query": "My name is Gustav, 65. I have arthritis pain. Are Turmeric supplements good?",
    "report": "Turmeric may have mild anti-inflammatory effects but is not as potent as prescription NSAIDs."
  },
  {
    "query": "I'm Helene, 40. I have trouble focusing. Is Ginkgo Biloba helpful?",
    "report": "Evidence for Ginkgo's cognitive benefits in healthy people is limited. Address sleep and stress first."
  },
  {
    "query": "I'm Ludwig, 52. Can I use St. John's Wort for mild depression?",
    "report": "Caution: St. John's Wort has serious drug interactions. Consult doctor before use."
  },
  {
    "query": "I'm Margot, 35. I have insomnia. Is Melatonin safe long-term?",
    "report": "Melatonin is generally safe for short-term use. Address underlying sleep issues for chronic insomnia."
  },
  {
    "query": "My name is Otto, 45. I have hot flashes. Is black cohosh effective?",
    "report": "Black cohosh may help some women, but evidence is mixed and product quality varies."
  },
  {
    "query": "I'm Paul, 58. I have enlarged prostate. Is saw palmetto effective?",
    "report": "Studies show saw palmetto is no more effective than placebo for BPH symptoms."
  },
  {
    "query": "My name as is Rosa, 33. I have UTI. Can cranberry pills cure it?",
    "report": "Cranberry may help prevention but cannot cure active infection. Antibiotics are required."
  },
  {
    "query": "I'm Siegfried, 49. I have high cholesterol. Are red yeast rice supplements good?",
    "report": "Red yeast rice contains natural statins but dosage is unregulated. Prescription statins provide controlled treatment."
  },
  {
    "query": "My name is Trude, 42. I have migraines. Is butterbur effective?",
    "report": "Butterbur has evidence for migraine prevention but must be PA-free due to liver toxicity concerns."
  },
  {
    "query": "I'm Wilhelm, 67. I take Warfarin. I sprained my ankle. Can I take Ibuprofen?",
    "report": "No, Ibuprofen significantly increases bleeding risk with Warfarin. Acetaminophen is safer."
  },
  {
    "query": "My name is Elsa, 55. I take Metoprolol. I have a cold. Can I take Sudafed?",
    "report": "Pseudoephedrine can counteract Metoprolol. Saline nasal spray is safer."
  },
  {
    "query": "I'm Franziska, 72. I take Levothyroxine. I have acid reflux. Can I take Omeprazole?",
    "report": "Yes, but take at least 4 hours apart. PPIs can interfere with Levothyroxine absorption."
  },
  {
    "query": "I'm Gunther, 60. I take HCTZ. I have diarrhea. Can I take Loperamide?",
    "report": "Yes, but focus on hydration with electrolytes since both can cause dehydration."
  },
  {
    "query": "My name is Hedwig, 68. I'm on Coumadin. Can I take Aspirin for headache?",
    "report": "No, Aspirin increases bleeding risk. Acetaminophen is safer for pain relief."
  },
  {
    "query": "I'm Ingo, 57. I take Lisinopril. Can I take Naproxen for back pain?",
    "report": "NSAIDs can reduce antihypertensive effect and harm kidneys. Acetaminophen is preferred."
  },
  {
    "query": "My name is Jutta, 63. I take Synthroid. Can I take calcium supplements?",
    "report": "Yes, but take at least 4 hours apart. Calcium can interfere with absorption."
  },
  {
    "query": "I'm Klaus, 59. I take Plavix. Can I take Prilosec for heartburn?",
    "report": "Omeprazole may reduce Clopidogrel effectiveness. Famotidine is a safer alternative."
  },
  {
    "query": "I'm always tired and cold. My sister takes thyroid medicine. Should I get same?",
    "report": "Your symptoms could indicate hypothyroidism. Ask your doctor for TSH blood test before considering medication."
  },
  {
    "query": "My name is Lars, 50. I have tingling feet. My diabetic friend takes Gabapentin. Do I need that?",
    "report": "Tingling has many causes. A doctor must diagnose neuropathy cause before considering Gabapentin."
  },
  {
    "query": "I'm Nadine, 28. I have bloating after eating. My mom takes IBS medicine. Should I try that?",
    "report": "Bloating could be IBS, lactose intolerance, or other issues. See doctor for proper diagnosis first."
  },
  {
    "query": "I'm Oliver, 45. I have trouble urinating. My father took prostate medicine. Should I start that?",
    "report": "Urinary symptoms require prostate exam and PSA test to confirm BPH before starting medications."
  },
  {
    "query": "My name is Paula, 35. I'm always tired. My friend takes B12 shots. Should I get them?",
    "report": "Get B12 levels tested first. Often fatigue is from other causes like sleep issues or stress."
  },
  {
    "query": "I have a UTI. Can I take Ciprofloxacin from my old prescription?",
    "report": "No, never use old antibiotics. Current infection may be resistant. Need new prescription."
  },
  {
    "query": "My name is Rainer, 41. I have sinus infection. Can I take my daughter's Amoxicillin?",
    "report": "Absolutely not. Never use anyone else's prescription. Dose is incorrect for adult."
  },
  {
    "query": "I'm Sabrina, 65. I have toothache. Can I take leftover Vicodin from surgery?",
    "report": "No, opioids not appropriate for toothache and carry addiction risk. See dentist for proper treatment."
  },
  {
    "query": "I'm Thomas, 20. I have jock itch. Can I use same Clotrimazole as athlete's foot?",
    "report": "Yes, Clotrimazole is effective against both jock itch and athlete's foot fungi."
  },
  {
    "query": "My name as is Ursula, 29. I have UTI symptoms. Can I take my old Cipro?",
    "report": "No, complete full course when prescribed. Old antibiotics may not match current infection."
  },
  {
    "query": "I'm pretty sure I have hemorrhoids. Can I get Preparation H at drugstore?",
    "report": "Yes, for mild self-diagnosed hemorrhoids, OTC creams with hydrocortisone are appropriate short-term."
  },
  {
    "query": "My name is Vanessa, 33. I think I have bladder infection. Can I get AZO pills?",
    "report": "AZO only numbs pain but doesn't treat infection. You need antibiotics from doctor for UTI."
  },
  {
    "query": "I'm Wolfgang, 18. I have dandruff. Is Head & Shoulders the right medicine?",
    "report": "Yes, Pyrithione zinc shampoo is effective first-line OTC treatment for common dandruff."
  },
  {
    "query": "My name is Yvonne, 55. I have wrist pain from typing. Can I use splint and Ibuprofen?",
    "report": "Yes, wrist splint and OTC Ibuprofen are standard initial self-care for suspected carpal tunnel."
  },
  {
    "query": "I'm Zacharias, 26. I'm pretty sure I have hemorrhoids. Can I get Preparation H?",
    "report": "Yes, for mild self-diagnosed hemorrhoids, OTC creams with hydrocortisone are appropriate."
  },
  {
    "query": "My name is Astrid, 29. I think I have UTI. Can I get cranberry pills?",
    "report": "Cranberry may help prevention but cannot cure active UTI. You need antibiotics."
  },
  {
    "query": "I'm Bastian, 22. I have athlete's foot. Can I get Lotrimin at pharmacy?",
    "report": "Yes, Clotrimazole is effective OTC antifungal for athlete's foot when used as directed."
  },
  {
    "query": "My name is Cornelia, 44. I think I have sinus infection. Can I get Sudafed?",
    "report": "Sudafed can relieve congestion but doesn't treat infection. See doctor if symptoms persist."
  },
  {
    "query": "I'm Dirk, 35. I'm pretty sure I have jock itch. Can I use antifungal cream?",
    "report": "Yes, OTC antifungal creams are appropriate for self-treated jock itch."
  },
  {
    "query": "I'm Elias, 48. Diagnosed with peripheral neuropathy. What medication for nerve pain?",
    "report": "Gabapentin, Pregabalin, or Duloxetine are commonly used for neuropathic pain."
  },
  {
    "query": "My name is Fiona, 37. I have bipolar disorder. What mood stabilizer first?",
    "report": "Lithium or Valproate are first-line mood stabilizers for bipolar disorder."
  },
  {
    "query": "I'm Gregor, 59. Diagnosed with sleep apnea. What treatment options?",
    "report": "CPAP therapy is first-line. Oral appliances or surgery are alternatives for some patients."
  },
  {
    "query": "My name as is Helena, 42. I have Crohn's disease. What biologic medication?",
    "report": "Anti-TNF agents like Infliximab or Adalimumab are used for moderate-severe Crohn's."
  },
  {
    "query": "I'm Isidor, 66. Diagnosed with wet macular degeneration. What injection?",
    "report": "Anti-VEGF injections like Ranibizumab or Aflibercept are standard treatment."
  },
  {
    "query": "My name is Johanna, 51. I have overactive bladder. What anticholinergic?",
    "report": "Oxybutynin, Tolterodine, or Solifenacin are anticholinergics for overactive bladder."
  },
  {
    "query": "I'm Konstantin, 57. Diagnosed with hepatitis C. What direct-acting antiviral?",
    "report": "Sofosbuvir/Velpatasvir or Glecaprevir/Pibrentasvir are common DAA regimens."
  },
  {
    "query": "My name is Larissa, 44. I have lupus. What hydroxychloroquine dose?",
    "report": "Hydroxychloroquine is weight-based, typically 400mg daily for average-weight adults."
  },
  {
    "query": "I'm Maximilian, 69. Diagnosed with myeloma. What proteasome inhibitor?",
    "report": "Bortezomib or Carfilzomib are proteasome inhibitors used in multiple myeloma."
  },
  {
    "query": "My name is Nora, 38. I have endometriosis. What GnRH agonist?",
    "report": "Leuprolide is commonly used, typically with add-back hormone therapy."
  },
  {
    "query": "I'm Orlando, 62. Diagnosed with pulmonary fibrosis. What antifibrotic?",
    "report": "Pirfenidone or Nintedanib are approved antifibrotic medications."
  },
  {
    "query": "My name is Penelope, 47. I have fibromyalgia. What medication first?",
    "report": "Duloxetine, Milnacipran, or Pregabalin are first-line for fibromyalgia."
  },
  {
    "query": "I'm Quentin, 71. Diagnosed with Parkinson's. What for tremor?",
    "report": "Levodopa is primary, but anticholinergics or beta-blockers may help specific tremor."
  },
  {
    "query": "My name is Ramona, 53. I have chronic migraine. What preventive?",
    "report": "Topiramate, Propranolol, or CGRP monoclonal antibodies for chronic migraine prevention."
  },
  {
    "query": "I'm Silas, 58. Diagnosed with prostate cancer. What hormone therapy?",
    "report": "GnRH agonists like Leuprolide or Goserelin are used for androgen deprivation."
  },
  {
    "query": "My name is Tabea, 41. I have rheumatoid arthritis. What biologic?",
    "report": "TNF inhibitors like Etanercept or Adalimumab are common first biologics."
  },
  {
    "query": "I'm Uwe, 64. Diagnosed with COPD exacerbation. What steroid dose?",
    "report": "Prednisone 40mg daily for 5-14 days is standard for COPD exacerbations."
  },
  {
    "query": "My name is Viola, 49. I have osteoporosis. What anabolic agent?",
    "report": "Teriparatide or Romosozumab are anabolic treatments for severe osteoporosis."
  },
  {
    "query": "I'm Willi, 72. Diagnosed with heart failure. What SGLT2 inhibitor?",
    "report": "Dapagliflozin or Empagliflozin are now standard for heart failure regardless of diabetes."
  },
  {
    "query": "My name is Xenia, 46. I have ulcerative colitis. What aminosalicylate?",
    "report": "Mesalamine is first-line, available oral or rectal depending on disease extent."
  },
  {
    "query": "I'm Yannick, 61. Diagnosed with gout. What urate-lowering therapy?",
    "report": "Allopurinol or Febuxostat are used for long-term urate lowering in recurrent gout."
  },
  {
    "query": "My name is Zara, 39. I have epilepsy. What broad-spectrum anticonvulsant?",
    "report": "Levetiracetam, Lamotrigine, or Topiramate are broad-spectrum options."
  },
  {
    "query": "I'm Aaron, 54. Diagnosed with shingles. What for postherpetic neuralgia?",
    "report": "Gabapentin, Pregabalin, or topical Lidocaine for postherpetic neuralgia pain."
  },
  {
    "query": "My name is Bianca, 43. I have PCOS. What metformin dose?",
    "report": "Typically starts 500mg daily, may increase to 1500-2000mg based on tolerance."
  },
  {
    "query": "I'm Cedric, 67. Diagnosed with low testosterone. What replacement?",
    "report": "Testosterone gel, injections, or pellets for confirmed hypogonadism."
  },
  {
    "query": "My name is Daria, 52. I have hot flashes. What non-hormonal option?",
    "report": "SSRIs like Paroxetine or Gabapentin can reduce menopausal hot flashes."
  },
  {
    "query": "I'm Enzo, 57. Diagnosed with angina. What nitrate?",
    "report": "Nitroglycerin sublingual for acute attacks; long-acting for prevention."
  },
  {
    "query": "My name as is Fatima, 45. I have migraine with aura. What triptan?",
    "report": "Triptans are generally safe with aura if taken after headache onset, not during aura."
  },
  {
    "query": "I'm Gianni, 63. Diagnosed with BPH. What 5-alpha reductase inhibitor?",
    "report": "Finasteride or Dutasteride reduce prostate size over months."
  },
  {
    "query": "My name is Hana, 48. I have rheumatoid arthritis. What JAK inhibitor?",
    "report": "Tofacitinib or Baricitinib for moderate-severe RA after DMARD failure."
  },
  {
    "query": "I'm Igor, 70. Diagnosed with Parkinson's. What MAO-B inhibitor?",
    "report": "Rasagiline or Selegiline as monotherapy or adjunct to Levodopa."
  },
  {
    "query": "My name is Jasmine, 41. I have chronic pain. What SNRI?",
    "report": "Duloxetine or Milnacipran are SNRIs used for chronic pain conditions."
  },
  {
    "query": "I'm Kaito, 58. Diagnosed with HIV. What INSTI regimen?",
    "report": "Bictegravir/Emtricitabine/Tenofovir or Dolutegravir-based regimens are first-line."
  },
  {
    "query": "My name is Lila, 50. I have osteopenia. What treatment?",
    "report": "Calcium, Vitamin D, and exercise first. Medication if high fracture risk."
  },
  {
    "query": "I'm Marco, 65. Diagnosed with AFib. What rate control medication?",
    "report": "Beta-blockers like Metoprolol or Calcium channel blockers like Diltiazem."
  },
  {
    "query": "My name is Nala, 47. I have psoriasis. What biologic?",
    "report": "TNF inhibitors, IL-17 inhibitors, or IL-23 inhibitors based on severity and type."
  },
  {
    "query": "I'm Omar, 59. Diagnosed with type 1 diabetes. What insulin regimen?",
    "report": "Multiple daily injections or insulin pump with basal and bolus insulin."
  },
  {
    "query": "My name is Priya, 42. I have hyperthyroidism. What antithyroid medication?",
    "report": "Methimazole is first-line; Propylthiouracil in first trimester pregnancy."
  },
  {
    "query": "I'm Qasim, 68. Diagnosed with Waldenström's. What BTK inhibitor?",
    "report": "Ibrutinib is used for Waldenström's macroglobulinemia."
  },
  {
    "query": "My name is Rania, 44. I have multiple sclerosis. What DMT first?",
    "report": "Interferon-beta, Glatiramer acetate, or newer oral agents based on disease activity."
  },
  {
    "query": "I'm Samir, 61. Diagnosed with gout. What for flare prevention?",
    "report": "Colchicine low-dose during initiation of urate-lowering therapy."
  },
  {
    "query": "My name as is Tara, 39. I have endometriosis pain. What progestin?",
    "report": "Norethindrone or Dienogest can help control endometriosis pain."
  },
  {
    "query": "I'm Umar, 56. Diagnosed with hepatitis B. What antiviral?",
    "report": "Entecavir or Tenofovir are first-line oral antivirals for chronic hepatitis B."
  },
  {
    "query": "My name is Veda, 49. I have cluster headaches. What verapamil dose?",
    "report": "Verapamil 240-480mg daily for cluster headache prevention."
  },
  {
    "query": "I'm Waleed, 62. Diagnosed with MGUS. What monitoring?",
    "report": "No treatment needed; regular monitoring for progression to myeloma or related conditions."
  },
  {
    "query": "My name is Ximena, 45. I have lichen planus. What topical steroid?",
    "report": "High-potency topical corticosteroids like Clobetasol for cutaneous lichen planus."
  },
  {
    "query": "I'm Yusuf, 71. Diagnosed with CLL. What BTK inhibitor?",
    "report": "Ibrutinib or Acalabrutinib for certain CLL patients."
  },
  {
    "query": "My name is Zola, 53. I have sarcoidosis. What steroid dose?",
    "report": "Prednisone 20-40mg daily initially, tapered to lowest effective dose."
  },
  {
    "query": "I'm Amit, 57. Diagnosed with ITP. What first-line treatment?",
    "report": "Corticosteroids like Prednisone or Dexamethasone for immune thrombocytopenia."
  },
  {
    "query": "My name is Bina, 46. I have trigeminal neuralgia. What medication?",
    "report": "Carbamazepine is first-line; Oxcarbazepine alternative."
  },
  {
    "query": "I'm Chirag, 64. Diagnosed with myelofibrosis. What JAK inhibitor?",
    "report": "Ruxolitinib for symptomatic myelofibrosis."
  },
  {
    "query": "My name is Devi, 51. I have scleroderma. What for Raynaud's?",
    "report": "Calcium channel blockers like Nifedipine for Raynaud's phenomenon."
  },
  {
    "query": "I'm Eshan, 58. Diagnosed with ALS. What riluzole dose?",
    "report": "Riluzole 50mg twice daily may slow ALS progression."
  },
  {
    "query": "My name as is Farah, 43. I have narcolepsy. What stimulant?",
    "report": "Modafinil or Armodafinil first-line; Sodium Oxybate for cataplexy."
  },
  {
    "query": "I'm Gopal, 69. Diagnosed with Paget's disease. What bisphosphonate?",
    "report": "Zoledronic acid single infusion often induces long remission."
  },
  {
    "query": "My name is Hina, 47. I have cystitis. What for recurrent UTIs?",
    "report": "Postcoital antibiotics or continuous prophylaxis for recurrent UTIs."
  },
  {
    "query": "I'm Indra, 60. Diagnosed with Guillain-Barré. What acute treatment?",
    "report": "IVIG or plasma exchange for acute Guillain-Barré syndrome."
  },
  {
    "query": "My name is Jaya, 54. I have Sjögren's. What for dry mouth?",
    "report": "Pilocarpine or Cevimeline to stimulate saliva production."
  },
  {
    "query": "I'm Karan, 61. Diagnosed with hemophilia. What factor replacement?",
    "report": "Recombinant Factor VIII for hemophilia A; Factor IX for hemophilia B."
  },
  {
    "query": "My name is Leela, 44. I have myasthenia gravis. What pyridostigmine dose?",
    "report": "Pyridostigmine 30-60mg every 4-6 hours for myasthenia symptoms."
  },
  {
    "query": "I'm Manoj, 67. Diagnosed with polycythemia vera. What phlebotomy target?",
    "report": "Phlebotomy to hematocrit <45% in men, <42% in women."
  },
  {
    "query": "My name as is Nisha, 50. I have cyclic vomiting. What abortive?",
    "report": "Sumatriptan or antiemetics like Ondansetron to abort episodes."
  },
  {
    "query": "I'm Omar, 57. Diagnosed with PAH. What endothelin antagonist?",
    "report": "Bosentan, Ambrisentan, or Macitentan for pulmonary arterial hypertension."
  },
  {
    "query": "My name is Pooja, 52. I have IIH. What acetazolamide dose?",
    "report": "Acetazolamide 1-4g daily in divided doses for idiopathic intracranial hypertension."
  },
  {
    "query": "I'm Qadir, 65. Diagnosed with Wilson's. What chelator?",
    "report": "D-penicillamine or Trientine for copper chelation in Wilson's disease."
  },
  {
    "query": "My name is Rani, 48. I have MCAS. What mast cell stabilizer?",
    "report": "Cromolyn sodium or Ketotifen for mast cell activation syndrome."
  },
  {
    "query": "I'm Sameer, 70. Diagnosed with hairy cell leukemia. What cladribine?",
    "report": "Cladribine single course often induces long remission."
  },
  {
    "query": "My name as is Tina, 45. I have cholestasis pregnancy. What ursodiol?",
    "report": "Ursodeoxycholic acid for pruritus in cholestasis of pregnancy."
  },
  {
    "query": "I'm Uday, 62. Diagnosed with Cushing's. What steroidogenesis inhibitor?",
    "report": "Ketoconazole or Metyrapone while awaiting definitive treatment."
  },
  {
    "query": "My name is Veena, 55. I have NMO. What immunosuppressant?",
    "report": "Azathioprine, Mycophenolate, or Rituximab for NMO spectrum disorder."
  },
  {
    "query": "I'm Wasim, 58. I have G6PD deficiency. What medications avoided?",
    "report": "Sulfa drugs, Nitrofurantoin, Dapsone, Primaquine should be avoided."
  },
  {
    "query": "My name is Xena, 46. I have HAE. What for acute attacks?",
    "report": "Icatibant or C1 esterase inhibitor concentrates for acute HAE attacks."
  },
  {
    "query": "I'm Yash, 71. Diagnosed with myelofibrosis. What ruxolitinib?",
    "report": "Ruxolitinib for symptomatic splenomegaly or constitutional symptoms."
  },
  {
    "query": "My name as is Zara, 53. I have Addison's. What fludrocortisone dose?",
    "report": "Fludrocortisone 0.1mg daily typically, adjusted by blood pressure and electrolytes."
  },
  {
    "query": "I'm Akash, 59. I have tuberous sclerosis. What everolimus for?",
    "report": "Everolimus for SEGAs or renal angiomyolipomas in tuberous sclerosis."
  },
  {
    "query": "My name is Bela, 42. I have POEMS syndrome. What treatment?",
    "report": "Radiation for solitary lesions; autologous stem cell transplant for diffuse disease."
  },
  {
    "query": "I'm Chanda, 66. I have Castleman disease. What siltuximab?",
    "report": "Siltuximab for multicentric Castleman disease."
  },
  {
    "query": "My name as is Diya, 49. I have achalasia. What pre-procedure medication?",
    "report": "Calcium channel blockers or nitrates provide temporary relief awaiting definitive treatment."
  },
  {
    "query": "I'm Ebrahim, 63. I have Graves' ophthalmopathy. What selenium?",
    "report": "Selenium 100mcg twice daily may help mild Graves' ophthalmopathy."
  },
  {
    "query": "My name is Falguni, 56. I have essential tremor. What primidone dose?",
    "report": "Primidone 25-250mg at bedtime, titrated slowly for essential tremor."
  },
  {
    "query": "I'm Ganesh, 60. I have dermatomyositis. What steroid-sparing agent?",
    "report": "Methotrexate or Azathioprine as steroid-sparing agents."
  },
  {
    "query": "My name as is Heena, 47. I have HLH. What etoposide?",
    "report": "Etoposide with dexamethasone for hemophagocytic lymphohistiocytosis."
  },
  {
    "query": "I'm Irfan, 68. I have cyclic vomiting. What amitriptyline preventive?",
    "report": "Amitriptyline 10-50mg at night for cyclic vomiting prevention."
  },
  {
    "query": "My name is Jivika, 54. I have rare skeletal disorder. What tocilizumab?",
    "report": "Tocilizumab shows promise for certain inflammatory skeletal disorders."
  },
  {
    "query": "I'm Kirti, 57. I have stiff person syndrome. What diazepam dose?",
    "report": "Diazepam 2-10mg three times daily for stiff person syndrome symptoms."
  },
  {
    "query": "My name as is Laxmi, 50. I have CADASIL. What management?",
    "report": "No specific treatment; manage vascular risk factors and symptoms."
  },
  {
    "query": "I'm Mustafa, 64. I have erythromelalgia. What medication?",
    "report": "Aspirin may help secondary form; Gabapentin or Mexiletine for primary."
  },
  {
    "query": "My name is Neha, 58. I have Waldenström's. What ibrutinib dose?",
    "report": "Ibrutinib 420mg daily for Waldenström's macroglobulinemia."
  },
  {
    "query": "I'm Omar, 61. I have chondrocalcinosis. What for acute pseudogout?",
    "report": "NSAIDs or Colchicine for acute pseudogout attacks."
  },
  {
    "query": "My name as is Preeti, 55. I have Fahr's disease. What treatment?",
    "report": "No specific treatment; manage movement disorders or psychiatric symptoms."
  },
  {
    "query": "I'm Qasim, 67. I have Sweet's syndrome. What prednisone dose?",
    "report": "Prednisone 0.5-1mg/kg daily for Sweet's syndrome."
  },
  {
    "query": "My name is Radhika, 52. I have Whipple's disease. What antibiotic?",
    "report": "Ceftriaxone followed by Trimethoprim-sulfamethoxazole long-term."
  },
  {
    "query": "I'm Salman, 69. I have LAM. What sirolimus?",
    "report": "Sirolimus for lymphangioleiomyomatosis with moderate-severe lung disease."
  },
  {
    "query": "My name as is Trisha, 48. I have Kaposi sarcoma. What liposomal doxorubicin?",
    "report": "Liposomal Doxorubicin for advanced Kaposi sarcoma."
  },
  {
    "query": "I'm Usman, 65. I have pseudotumor cerebri. What acetazolamide?",
    "report": "Acetazolamide 1-4g daily for idiopathic intracranial hypertension."
  },
  {
    "query": "My name is Varsha, 59. I have mesenteric panniculitis. What tamoxifen?",
    "report": "Tamoxifen may help symptomatic mesenteric panniculitis."
  },
  {
    "query": "I'm Waseem, 62. I have chondromalacia. What injection option?",
    "report": "Hyaluronic acid injections may help chondromalacia patellae pain."
  },
  {
    "query": "My name as is Xena, 56. I have EGPA. What mepolizumab?",
    "report": "Mepolizumab for eosinophilic granulomatosis with polyangiitis."
  },
  {
    "query": "I'm Youssef, 70. I have PRP. What acitretin?",
    "report": "Acitretin for pityriasis rubra pilaris."
  },
  {
    "query": "My name is Zara, 53. I have Schnitzler syndrome. What anakinra?",
    "report": "Anakinra highly effective for Schnitzler syndrome."
  },
  {
    "query": "I'm Aarav, 57. I have multicentric reticulohistiocytosis. What methotrexate?",
    "report": "Methotrexate with corticosteroids for multicentric reticulohistiocytosis."
  },
  {
    "query": "My name as is Bhavna, 49. I have Erdheim-Chester. What targeted therapy?",
    "report": "Vemurafenib if BRAF V600E mutation positive; Interferon-alpha if wild-type."
  },
  {
    "query": "I'm Chetan, 66. I have Lemierre's syndrome. What antibiotic?",
    "report": "Piperacillin-tazobactam or Carbapenems for Lemierre's syndrome."
  },
  {
    "query": "My name is Deepa, 51. I have Kikuchi disease. What treatment?",
    "report": "Supportive care with NSAIDs; corticosteroids for severe cases."
  },
  {
    "query": "I'm Esha, 63. I have Sneddon-Wilkinson. What dapsone dose?",
    "report": "Dapsone 50-150mg daily for subcorneal pustular dermatosis."
  },
  {
    "query": "My name as is Farida, 58. I have trigeminal trophic syndrome. What medication?",
    "report": "Carbamazepine or Gabapentin for neuropathic pain in this condition."
  },
  {
    "query": "I'm Gaurav, 71. I have Degos disease. What antiplatelet?",
    "report": "Aspirin or other antiplatelets may be tried for malignant atrophic papulosis."
  },
  {
    "query": "My name is Harsha, 54. I have Kimura's disease. What prednisone?",
    "report": "Prednisone 30-60mg daily for Kimura's disease."
  },
  {
    "query": "I'm Inder, 67. I have Wells syndrome. What first-line?",
    "report": "Oral corticosteroids first-line for eosinophilic cellulitis."
  },
  {
    "query": "My name as is Jyoti, 50. I have Ormond's disease. What tamoxifen?",
    "report": "Tamoxifen may help retroperitoneal fibrosis."
  },
  {
    "query": "I'm Karan, 72. I have Mucha-Habermann. What antibiotic?",
    "report": "Erythromycin or Tetracyclines for pityriasis lichenoides."
  },
  {
    "query": "My name is Leela, 55. I have Terson syndrome. What treatment?",
    "report": "Vitrectomy for persistent vitreous hemorrhage."
  },
  {
    "query": "I'm Manish, 68. I have Rowell syndrome. What treatment?",
    "report": "Hydroxychloroquine with corticosteroids for Rowell syndrome."
  },
  {
    "query": "My name as is Nandini, 52. I have Froin's syndrome. What indicates?",
    "report": "Xanthochromia with high CSF protein suggests spinal block."
  },
  {
    "query": "I'm Omkar, 69. I have Crow-Fukase syndrome. What POEMS treatment?",
    "report": "Radiation for solitary lesions; autologous stem cell transplant for diffuse."
  },
  {
    "query": "My name is Pooja, 56. I have trigeminal neuralgia. What carbamazepine?",
    "report": "Carbamazepine 100-200mg twice daily, titrated up for trigeminal neuralgia."
  },
  {
    "query": "I'm Qasim, 73. I have hemochromatosis. What phlebotomy schedule?",
    "report": "Weekly phlebotomy until ferritin 50-100ng/mL, then maintenance."
  },
  {
    "query": "My name as is Ritu, 57. I have carcinoid syndrome. What octreotide?",
    "report": "Octreotide for carcinoid syndrome symptom control."
  },
  {
    "query": "I'm Sameer, 70. I have eosinophilic esophagitis. What fluticasone?",
    "report": "Swallowed Fluticasone for eosinophilic esophagitis."
  },
  {
    "query": "My name is Tanvi, 53. I have narcolepsy with cataplexy. What sodium oxybate?",
    "report": "Sodium Oxybate for narcolepsy with cataplexy."
  },
  {
    "query": "I'm Uday, 66. I have Guillain-Barré. What IVIG dose?",
    "report": "IVIG 2g/kg over 2-5 days for Guillain-Barré syndrome."
  },
  {
    "query": "My name as is Vanya, 59. I have Sjögren's dry mouth. What pilocarpine?",
    "report": "Pilocarpine 5mg three times daily for dry mouth in Sjögren's."
  },
  {
    "query": "I'm Wasim, 72. I have hemophilia A. What factor VIII prophylaxis?",
    "report": "Factor VIII 25-40 IU/kg three times weekly for prophylaxis."
  },
  {
    "query": "My name is Xena, 55. I have myasthenia gravis. What pyridostigmine?",
    "report": "Pyridostigmine 30-60mg every 4-6 hours for symptom control."
  },
  {
    "query": "I'm Yash, 68. I have polycythemia vera. What hydroxyurea?",
    "report": "Hydroxyurea for high-risk polycythemia vera."
  },
  {
    "query": "My name as is Zara, 61. I have cyclic vomiting. What ondansetron?",
    "report": "Ondansetron 4-8mg as needed for nausea in cyclic vomiting."
  },
  {
    "query": "I'm Akash, 74. I have PAH. What macitentan?",
    "report": "Macitentan 10mg daily for pulmonary arterial hypertension."
  },
  {
    "query": "My name is Bela, 58. I have IIH. What weight loss goal?",
    "report": "5-10% weight loss can significantly improve idiopathic intracranial hypertension."
  },
  {
    "query": "I'm Chanda, 71. I have Wilson's disease. What trientine?",
    "report": "Trientine 750-1500mg daily in divided doses for copper chelation."
  },
  {
    "query": "My name as is Diya, 64. I have MCAS. What cromolyn?",
    "report": "Cromolyn sodium 100mg four times daily for mast cell activation."
  },
  {
    "query": "I'm Ebrahim, 69. I have hairy cell leukemia. What cladribine?",
    "report": "Cladribine 0.1mg/kg daily for 7 days continuous infusion."
  },
  {
    "query": "My name is Falguni, 62. I have cholestasis pregnancy. What ursodiol?",
    "report": "Ursodeoxycholic acid 10-15mg/kg daily for pregnancy cholestasis."
  },
  {
    "query": "I'm Ganesh, 75. I have Cushing's disease. What ketoconazole?",
    "report": "Ketoconazole 400-1200mg daily for Cushing's disease medical therapy."
  },
  {
    "query": "My name as is Heena, 68. I have NMO. What rituximab?",
    "report": "Rituximab for neuromyelitis optica spectrum disorder."
  },
  {
    "query": "I'm Irfan, 73. I have G6PD deficiency. What drugs absolutely avoided?",
    "report": "Dapsone, Primaquine, Nitrofurantoin absolutely contraindicated."
  },
  {
    "query": "My name is Jivika, 66. I have HAE. What icatibant?",
    "report": "Icatibant 30mg subcutaneously for acute HAE attacks."
  },
  {
    "query": "I'm Kirti, 69. I have primary myelofibrosis. What fedratinib?",
    "report": "Fedratinib for myelofibrosis in patients resistant to ruxolitinib."
  },
  {
    "query": "My name as is Laxmi, 72. I have Addison's. What hydrocortisone stress dosing?",
    "report": "Double or triple hydrocortisone dose during illness or stress."
  },
  {
    "query": "I'm Mustafa, 77. I have tuberous sclerosis. What everolimus for SEGAs?",
    "report": "Everolimus for subependymal giant cell astrocytomas in TS."
  },
  {
    "query": "My name is Neha, 70. I have POEMS syndrome. What lenalidomide?",
    "report": "Lenalidomide with dexamethasone for POEMS syndrome."
  },
  {
    "query": "I'm Omar, 75. I have Castleman disease. What siltuximab dosing?",
    "report": "Siltuximab 11mg/kg every 3 weeks for multicentric Castleman disease."
  },
  {
    "query": "My name as is Preeti, 68. I have achalasia. What nifedipine?",
    "report": "Nifedipine 10-20mg before meals for temporary achalasia relief."
  },
  {
    "query": "I'm Qasim, 73. I have Graves' ophthalmopathy. What selenium evidence?",
    "report": "Selenium 100mcg twice daily showed benefit in mild Graves' ophthalmopathy."
  },
  {
    "query": "My name is Radhika, 66. I have essential tremor. What propranolol?",
    "report": "Propranolol 60-320mg daily for essential tremor."
  },
  {
    "query": "I'm Salman, 79. I have dermatomyositis. What IVIG?",
    "report": "IVIG for refractory dermatomyositis."
  },
  {
    "query": "My name as is Trisha, 72. I have HLH. What HLH-94 protocol?",
    "report": "HLH-94 protocol with dexamethasone, etoposide for hemophagocytic lymphohistiocytosis."
  },
  {
    "query": "I'm Usman, 77. I have cyclic vomiting. What cyproheptadine?",
    "report": "Cyproheptadine for pediatric cyclic vomiting syndrome prevention."
  },
  {
    "query": "My name is Varsha, 70. I have rare skeletal disorder. What IL-1 inhibitor?",
    "report": "IL-1 inhibitors like Anakinra for certain autoinflammatory skeletal disorders."
  },
  {
    "query": "I'm Waseem, 75. I have stiff person syndrome. What baclofen?",
    "report": "Baclofen intrathecal for severe stiff person syndrome."
  },
  {
    "query": "My name as is Xena, 68. I have CADASIL. What aspirin?",
    "report": "Aspirin may be used for secondary stroke prevention in CADASIL."
  },
  {
    "query": "I'm Youssef, 81. I have erythromelalgia. What mexiletine?",
    "report": "Mexiletine for refractory erythromelalgia pain."
  },
  {
    "query": "My name is Zara, 74. I have Waldenström's. What zanubrutinib?",
    "report": "Zanubrutinib alternative BTK inhibitor for Waldenström's."
  },
  {
    "query": "I'm Aarav, 77. I have chondrocalcinosis. What colchicine prophylaxis?",
    "report": "Colchicine 0.6mg once or twice daily for recurrent pseudogout prevention."
  },
  {
    "query": "My name as is Bhavna, 70. I have Fahr's disease. What management?",
    "report": "Symptomatic management of movement disorders, psychiatric symptoms."
  },
  {
    "query": "I'm Chetan, 83. I have Sweet's syndrome. What potassium iodide?",
    "report": "Potassium iodide historical use, now corticosteroids first-line."
  },
  {
    "query": "My name is Deepa, 76. I have Whipple's disease. What duration treatment?",
    "report": "12-18 months antibiotics for Whipple's disease."
  },
  {
    "query": "I'm Esha, 79. I have LAM. What sirolimus level?",
    "report": "Sirolimus trough 5-15ng/mL for lymphangioleiomyomatosis."
  },
  {
    "query": "My name as is Farida, 72. I have Kaposi sarcoma. What paclitaxel?",
    "report": "Paclitaxel for advanced Kaposi sarcoma."
  },
  {
    "query": "I'm Gaurav, 85. I have pseudotumor cerebri. What topiramate?",
    "report": "Topiramate alternative to acetazolamide for IIH."
  },
  {
    "query": "My name is Harsha, 78. I have mesenteric panniculitis. What colchicine?",
    "report": "Colchicine may help some cases of mesenteric panniculitis."
  },
  {
    "query": "I'm Inder, 81. I have chondromalacia. What physical therapy?",
    "report": "Physical therapy first-line for chondromalacia patellae."
  },
  {
    "query": "My name as is Jyoti, 74. I have EGPA. What glucocorticoid taper?",
    "report": "Glucocorticoids tapered over 6-12 months for eosinophilic granulomatosis."
  },
  {
    "query": "I'm Karan, 87. I have PRP. What methotrexate?",
    "report": "Methotrexate for pityriasis rubra pilaris."
  },
  {
    "query": "My name is Leela, 80. I have Schnitzler syndrome. What canakinumab?",
    "report": "Canakinumab alternative IL-1 inhibitor for Schnitzler syndrome."
  },
  {
    "query": "I'm Manish, 83. I have multicentric reticulohistiocytosis. What TNF inhibitor?",
    "report": "TNF inhibitors for refractory multicentric reticulohistiocytosis."
  },
  {
    "query": "My name as is Nandini, 76. I have Erdheim-Chester. What cobimetinib?",
    "report": "Cobimetinib for BRAF wild-type Erdheim-Chester disease."
  },
  {
    "query": "I'm Omkar, 89. I have Lemierre's syndrome. What anticoagulation?",
    "report": "Anticoagulation controversial in Lemierre's; antibiotics primary."
  },
  {
    "query": "My name is Pooja, 82. I have Kikuchi disease. What prognosis?",
    "report": "Excellent prognosis; most resolve spontaneously in 1-4 months."
  },
  {
    "query": "I'm Qasim, 85. I have Sneddon-Wilkinson. What acitretin?",
    "report": "Acitretin alternative for subcorneal pustular dermatosis."
  },
  {
    "query": "My name as is Ritu, 78. I have trigeminal trophic syndrome. What referral?",
    "report": "Neurology and dermatology referral for trigeminal trophic syndrome."
  },
  {
    "query": "I'm Sameer, 91. I have Degos disease. What treprostinil?",
    "report": "Treprostinil for malignant Degos disease with systemic involvement."
  },
  {
    "query": "My name is Tanvi, 84. I have Kimura's disease. What surgical option?",
    "report": "Surgical excision for localized Kimura's disease."
  },
  {
    "query": "I'm Uday, 87. I have Wells syndrome. What dapsone?",
    "report": "Dapsone alternative for eosinophilic cellulitis."
  },
  {
    "query": "My name as is Vanya, 80. I have Ormond's disease. What tamoxifen efficacy?",
    "report": "Tamoxifen shows benefit in some retroperitoneal fibrosis cases."
  },
  {
    "query": "I'm Wasim, 93. I have Mucha-Habermann. What phototherapy?",
    "report": "Phototherapy for pityriasis lichenoides."
  },
  {
    "query": "My name is Xena, 86. I have Terson syndrome. What timing vitrectomy?",
    "report": "Vitrectomy typically considered after 3 months if no spontaneous resolution."
  },
  {
    "query": "I'm Yash, 89. I have Rowell syndrome. What diagnostic criteria?",
    "report": "Rowell syndrome: lupus erythematosus with erythema multiforme-like lesions."
  },
  {
    "query": "My name as is Zara, 82. I have Froin's syndrome. What CSF findings?",
    "report": "Xanthochromic CSF with very high protein, normal cell count in Froin's."
  },
  {
    "query": "I'm Akash, 95. I have Crow-Fukase syndrome. What radiation dose?",
    "report": "45-54Gy radiation for solitary plasmacytoma in POEMS."
  },
  {
    "query": "My name is Bela, 88. I have trigeminal neuralgia. What microvascular decompression?",
    "report": "Microvascular decompression surgical option for refractory trigeminal neuralgia."
  }
]